InformationRegisters/СредниеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СредниеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СредняяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HTTPServices/АвтоИЦены/Ext/Module.bsl
#Область ОбработчикиHTTPСервиса

// Возвращает JSON со случайной записью регистра СредниеЦены.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос
//
// Возвращаемое значение:
//  HTTPСервисОтвет
//
Функция ПолучитьСлучайнуюСреднююЦену(Запрос)
	
	ДанныеОтвета = СлучайнаяЗаписьСреднихЦен();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СлучайнаяЗаписьСреднихЦен()
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("Автомобиль", "");
	ДанныеОтвета.Вставить("СредняяЦена", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СредниеЦены.Автомобиль КАК Автомобиль,
	|	СредниеЦены.СредняяЦена КАК СредняяЦена
	|ИЗ
	|	РегистрСведений.СредниеЦены КАК СредниеЦены";
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	КоличествоЗаписей = ТаблицаЗаписей.Количество();
	Если КоличествоЗаписей = 0 Тогда
		Возврат ДанныеОтвета;
	КонецЕсли;
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	ИндексЗаписи = Генератор.СлучайноеЧисло(0, КоличествоЗаписей - 1);
	СтрокаЗаписи = ТаблицаЗаписей[ИндексЗаписи];
	
	ДанныеОтвета.Автомобиль = Строка(СтрокаЗаписи.Автомобиль);
	ДанныеОтвета.СредняяЦена = СтрокаЗаписи.СредняяЦена;
	
	Возврат ДанныеОтвета;
	
КонецФункции

#КонецОбласти
